uhnp/src/InformationRegisters/МоделированиеДвиженийИнвестиций/МоделированиеДвиженийИнвестиций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МоделированиеДвиженийИнвестиций</name>
  <resources>
    <name>ПрямаяДоляВладения</name>
    <type>
      <types>DefinedType.ДоляВладенияНеотрицательное</types>
    </type>
  </resources>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПривилегированных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВДоверительномУправлении</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоГолосующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инвестиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БалансоваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </attributes>
  <attributes>
    <name>МСО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИнвестирования</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/МоделированиеДвиженийИнвестиций/Forms/ФормаМСО/Module.bsl
&НаКлиенте
Процедура СкопироватьСтроку(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	ПараметрыЗаполнения = Новый Структура;
 	ПараметрыЗаполнения.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаполнения.Вставить("МСО", Истина);
	ПараметрыЗаполнения.Вставить("Сценарий", Сценарий);
 	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения, СкрытьСценарий", ПараметрыЗаполнения, Истина);
	ОткрытьФорму("РегистрСведений.МоделированиеДвиженийИнвестиций.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Сценарий = ОбщегоНазначенияПовтИспУХ.СценарийКИК();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Провести(Команда)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		УстановитьАтрибутОбъекта(Элементы.Список.ТекущиеДанные.Ссылка, "Провести")
	Иначе
		СоздатьИПровестиДокумент(Новый Структура("Инвестор, ОбъектИнвестирования, ПрямаяДоляВладения", Элементы.Список.ТекущиеДанные.Инвестор, Элементы.Список.ТекущиеДанные.ОбъектИнвестирования, Элементы.Список.ТекущиеДанные.ПрямаяДоляВладения));
		//УдалитьЗаписьРегистра(Элементы.Список.ТекущиеДанные.Инвестор, Элементы.Список.ТекущиеДанные.ОбъектИнвестирования, Сценарий);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПроведения(Команда)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		УстановитьАтрибутОбъекта(Элементы.Список.ТекущиеДанные.Ссылка, "ОтменаПроведения")
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		УстановитьАтрибутОбъекта(Элементы.Список.ТекущиеДанные.Ссылка, "Удаление")
	Иначе
		УдалитьЗаписьРегистра(Элементы.Список.ТекущиеДанные.Инвестор, Элементы.Список.ТекущиеДанные.ОбъектИнвестирования, Сценарий);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗаписьРегистра(Инвестор, ОбъектИнвестирования, Сценарий)
	Набор = РегистрыСведений.МоделированиеДвиженийИнвестиций.СоздатьНаборЗаписей();
	Набор.Отбор.Инвестор.Установить(Инвестор);
	Набор.Отбор.ОбъектИнвестирования.Установить(ОбъектИнвестирования);
	Набор.Отбор.Сценарий.Установить(Сценарий);
	Набор.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьАтрибутОбъекта(ПоступлениеИнвестиций, Действие)
	Объект = ПоступлениеИнвестиций.ПолучитьОбъект();
	Если Действие = "Удаление" Тогда
		Объект.УстановитьПометкуУдаления(Истина);
	ИначеЕсли Действие = "Провести" Тогда
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли Действие = "ОтменаПроведения" Тогда
		Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура СоздатьИПровестиДокумент(СтрокаЗаполнения)
	Перем СозданныеДокументы;
	
	ВыделенныеСтроки = РегистрыСведений.МоделированиеДвиженийИнвестиций.СоздатьНаборЗаписей().ВыгрузитьКолонки();		
	СтрокаТаб = ВыделенныеСтроки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаб, СтрокаЗаполнения);
	
	Если Не ЗначениеЗаполнено(СтрокаТаб.Дата) Тогда
		СтрокаТаб.Дата = ТекущаяДата();			
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТаб.Сценарий) Тогда
		СтрокаТаб.Сценарий = Сценарий;			
	КонецЕсли;
	СтрокаТаб.МСО = Истина;
	
	Попытка
		СозданныеДокументы = Обработки.СтруктураВладения.СформироватьДвиженияИнвестицийПоТаблицеМоделирования(Сценарий, ВыделенныеСтроки);
	Исключение
		Сообщить(НСтр("ru = 'Не удалось сформировать Движения инвестиций по причине: '") + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Ссылка) Тогда
		ПоказатьЗначение(, Элементы.Список.ТекущиеДанные.Ссылка);
	Иначе
		ЗначениеКлюча = Новый Структура("Инвестор, ОбъектИнвестирования, Сценарий", Элементы.Список.ТекущиеДанные.Инвестор, Элементы.Список.ТекущиеДанные.ОбъектИнвестирования, Сценарий);
        МассивКлючей = Новый Массив;
        МассивКлючей.Добавить(ЗначениеКлюча);
        КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.МоделированиеДвиженийИнвестиций", МассивКлючей);
        ОткрытьФорму("РегистрСведений.МоделированиеДвиженийИнвестиций.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
	КонецЕсли;
КонецПроцедуры
